## 🏗️ Terraform Plan - `staging` Environment

### Workflow Status
| Step | Status |
|------|--------|
| 🖌️ Format | ⚠️ |
| ⚙️ Init | ✅ |
| ✅ Validate | ✅ |
| 📖 Plan | ✅ |
| 🔒 Security Scan | ✅ |

### Resource Changes
| Action | Count |
|--------|-------|
| 🟢 Create | 8 |
| 🟡 Update | 0 |
| 🔴 Delete | 2 |

<details>
<summary>📋 Show Full Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.aks.azurerm_kubernetes_cluster.main will be created
  + resource "azurerm_kubernetes_cluster" "main" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + automatic_channel_upgrade           = "stable"
      + azure_policy_enabled                = true
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "banking-staging"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.32"
      + location                            = "eastus"
      + name                                = "banking-staging-aks"
      + node_resource_group                 = "banking-staging-aks-nodes-rg"
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_enabled                 = true
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = true
      + private_cluster_public_fqdn_enabled = true
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "banking-staging-rg"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Standard"
      + support_plan                        = "KubernetesOfficial"
      + tags                                = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
      + workload_identity_enabled           = true

      + azure_active_directory_role_based_access_control {
          + admin_group_object_ids = []
          + azure_rbac_enabled     = true
          + managed                = true
          + tenant_id              = (known after apply)
        }

      + default_node_pool {
          + enable_auto_scaling          = true
          + kubelet_disk_type            = (known after apply)
          + max_count                    = 4
          + max_pods                     = 50
          + min_count                    = 2
          + name                         = "system"
          + node_count                   = 2
          + node_labels                  = {
              + "environment" = "staging"
              + "nodepool"    = "system"
            }
          + only_critical_addons_enabled = true
          + orchestrator_version         = (known after apply)
          + os_disk_size_gb              = 128
          + os_disk_type                 = "Managed"
          + os_sku                       = (known after apply)
          + scale_down_mode              = "Delete"
          + tags                         = {
              + "CostCenter"  = "staging"
              + "Environment" = "staging"
              + "ManagedBy"   = "Terraform"
              + "Owner"       = "devops@company.com"
              + "Project"     = "banking"
            }
          + type                         = "VirtualMachineScaleSets"
          + ultra_ssd_enabled            = false
          + vm_size                      = "Standard_DC4ds_v3"
          + vnet_subnet_id               = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-staging-rg/providers/Microsoft.Network/virtualNetworks/banking-staging-vnet/subnets/banking-staging-aks-subnet"
          + workload_runtime             = (known after apply)

          + upgrade_settings {
              + max_surge = "33%"
            }
        }

      + identity {
          + identity_ids = [
              + "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-staging-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/banking-staging-aks-identity",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + key_vault_secrets_provider {
          + secret_identity          = (known after apply)
          + secret_rotation_enabled  = true
          + secret_rotation_interval = "2m"
        }

      + microsoft_defender {
          + log_analytics_workspace_id = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-staging-rg/providers/Microsoft.OperationalInsights/workspaces/banking-staging-law"
        }

      + network_profile {
          + dns_service_ip          = "10.100.0.10"
          + docker_bridge_cidr      = (known after apply)
          + ebpf_data_plane         = (known after apply)
          + ip_versions             = (known after apply)
          + load_balancer_sku       = "standard"
          + network_data_plane      = (known after apply)
          + network_mode            = (known after apply)
          + network_plugin          = "azure"
          + network_policy          = "azure"
          + outbound_ip_address_ids = (known after apply)
          + outbound_ip_prefix_ids  = (known after apply)
          + outbound_type           = "loadBalancer"
          + pod_cidr                = (known after apply)
          + pod_cidrs               = (known after apply)
          + service_cidr            = "10.100.0.0/16"
          + service_cidrs           = (known after apply)
        }

      + oms_agent {
          + log_analytics_workspace_id      = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-staging-rg/providers/Microsoft.OperationalInsights/workspaces/banking-staging-law"
          + msi_auth_for_monitoring_enabled = true
          + oms_agent_identity              = (known after apply)
        }
    }

  # module.aks.azurerm_kubernetes_cluster_node_pool.spot[0] will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "spot" {
      + enable_auto_scaling   = true
      + eviction_policy       = "Delete"
      + id                    = (known after apply)
      + kubelet_disk_type     = (known after apply)
      + kubernetes_cluster_id = (known after apply)
      + max_count             = 10
      + max_pods              = 50
      + min_count             = 0
      + mode                  = "User"
      + name                  = "spot"
      + node_count            = (known after apply)
      + node_labels           = {
          + "nodepool" = "spot"
        }
      + node_taints           = [
          + "kubernetes.azure.com/scalesetpriority=spot:NoSchedule",
        ]
      + orchestrator_version  = (known after apply)
      + os_disk_size_gb       = 128
      + os_disk_type          = "Managed"
      + os_sku                = (known after apply)
      + os_type               = "Linux"
      + priority              = "Spot"
      + scale_down_mode       = "Delete"
      + spot_max_price        = -1
      + tags                  = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
      + ultra_ssd_enabled     = false
      + vm_size               = "Standard_D4s_v5"
      + vnet_subnet_id        = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-staging-rg/providers/Microsoft.Network/virtualNetworks/banking-staging-vnet/subnets/banking-staging-aks-subnet"
    }

  # module.aks.azurerm_kubernetes_cluster_node_pool.user will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "user" {
      + enable_auto_scaling   = true
      + id                    = (known after apply)
      + kubelet_disk_type     = (known after apply)
      + kubernetes_cluster_id = (known after apply)
      + max_count             = 8
      + max_pods              = 50
      + min_count             = 2
      + mode                  = "User"
      + name                  = "user"
      + node_count            = 2
      + node_labels           = {
          + "environment" = "staging"
          + "nodepool"    = "user"
        }
      + orchestrator_version  = (known after apply)
      + os_disk_size_gb       = 128
      + os_disk_type          = "Managed"
      + os_sku                = (known after apply)
      + os_type               = "Linux"
      + priority              = "Regular"
      + scale_down_mode       = "Delete"
      + spot_max_price        = -1
      + tags                  = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
      + ultra_ssd_enabled     = false
      + vm_size               = "Standard_DC4ds_v3"
      + vnet_subnet_id        = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-staging-rg/providers/Microsoft.Network/virtualNetworks/banking-staging-vnet/subnets/banking-staging-aks-subnet"

      + upgrade_settings {
          + max_surge = "33%"
        }
    }

  # module.aks.azurerm_monitor_diagnostic_setting.aks[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "aks" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-staging-rg/providers/Microsoft.OperationalInsights/workspaces/banking-staging-law"
      + name                           = "banking-staging-aks-diagnostics"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "kube-apiserver"
        }
      + enabled_log {
          + category = "kube-audit"
        }
      + enabled_log {
          + category = "kube-audit-admin"
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.aks.azurerm_role_assignment.aks_acr_pull[0] will be created
  + resource "azurerm_role_assignment" "aks_acr_pull" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-staging-rg/providers/Microsoft.ContainerRegistry/registries/bankingstagingacr"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.keyvault.azurerm_key_vault.main will be created
  + resource "azurerm_key_vault" "main" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = true
      + enabled_for_deployment          = false
      + enabled_for_disk_encryption     = true
      + enabled_for_template_deployment = false
      + id                              = (known after apply)
      + location                        = "eastus"
      + name                            = "banking-stg-kv-uxrlow"
      + public_network_access_enabled   = true
      + purge_protection_enabled        = true
      + resource_group_name             = "banking-staging-rg"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 30
      + tags                            = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
      + tenant_id                       = "fdc5ebae-7028-4044-bde5-e0dfd654368b"
      + vault_uri                       = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
        }
    }

  # module.keyvault.azurerm_monitor_diagnostic_setting.keyvault[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "keyvault" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-staging-rg/providers/Microsoft.OperationalInsights/workspaces/banking-staging-law"
      + name                           = "banking-stg-kv-uxrlow-diagnostics"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "AuditEvent"
        }
      + enabled_log {
          + category = "AzurePolicyEvaluationDetails"
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.keyvault.azurerm_role_assignment.terraform_admin[0] will be created
  + resource "azurerm_role_assignment" "terraform_admin" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "9676d6b0-2054-4fde-823f-4d3be8e0a6ca"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.monitoring_alerts.azurerm_monitor_action_group.critical will be destroyed
  # (because azurerm_monitor_action_group.critical is not in configuration)
  - resource "azurerm_monitor_action_group" "critical" {
      - enabled             = true -> null
      - id                  = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-staging-rg/providers/Microsoft.Insights/actionGroups/banking-staging-alerts-critical-ag" -> null
      - location            = "global" -> null
      - name                = "banking-staging-alerts-critical-ag" -> null
      - resource_group_name = "banking-staging-rg" -> null
      - short_name          = "Critical" -> null
      - tags                = {
          - "CostCenter"  = "staging"
          - "Environment" = "staging"
          - "ManagedBy"   = "Terraform"
          - "Owner"       = "devops@company.com"
          - "Project"     = "banking"
        } -> null
    }

  # module.monitoring_alerts.azurerm_monitor_action_group.warning will be destroyed
  # (because azurerm_monitor_action_group.warning is not in configuration)
  - resource "azurerm_monitor_action_group" "warning" {
      - enabled             = true -> null
      - id                  = "/subscriptions/3d199ce0-f8a3-407c-bba9-dd146ade2775/resourceGroups/banking-staging-rg/providers/Microsoft.Insights/actionGroups/banking-staging-alerts-warning-ag" -> null
      - location            = "global" -> null
      - name                = "banking-staging-alerts-warning-ag" -> null
      - resource_group_name = "banking-staging-rg" -> null
      - short_name          = "Warning" -> null
      - tags                = {
          - "CostCenter"  = "staging"
          - "Environment" = "staging"
          - "ManagedBy"   = "Terraform"
          - "Owner"       = "devops@company.com"
          - "Project"     = "banking"
        } -> null
    }

Plan: 8 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  + aks_private_fqdn                       = (known after apply)
  + keyvault_uri                           = (known after apply)

```

</details>

---
*Triggered by @boateng0303 | Workflow: `Terraform PR Validation` | [View Logs](https://github.com/boateng0303/secure-bankapp-devsecops/actions/runs/20702954215)*